### port_lite database: stocks tables
### portmy database: profits, stocks tables
### portpg database: consensus, tickers tables
### csv files: consensus-ORD.csv

In [2]:
import pandas as pd
import numpy as np
import os

from datetime import date, timedelta
from sqlalchemy import create_engine
from pandas.tseries.offsets import BDay

engine = create_engine("sqlite:///c:\\ruby\\portmy\\db\\development.sqlite3")
conmy = engine.connect()
engine = create_engine("postgresql+psycopg2://postgres:admin@localhost:5432/portpg_development")
conpg = engine.connect()
engine = create_engine("sqlite:///c:\\ruby\\port_lite\\db\\development.sqlite3")
conlite = engine.connect()
engine = create_engine('mysql+pymysql://root:@localhost:3306/stock')
const = engine.connect()

data_path = os.path.join(os.path.expanduser("~"), "OneDrive","A5","Data")
csv_path = os.path.join(os.path.expanduser("~"), "iCloudDrive")
one_path = os.path.join(os.path.expanduser("~"), "OneDrive","Documents","Data")
osd_path = os.path.join(os.path.expanduser("~"),"OneDrive","Documents","obsidian-git-sync","Data")
dts_path = os.path.join(os.path.expanduser("~"),"Downloads","Datasets")

# Define a formatting function to format integers with zero decimal places and floats with two decimal places
def format_cell(x):
    if isinstance(x, int):
        return "{:,.0f}".format(x)
    elif isinstance(x, float):
        return "{:.2f}".format(x)
    else:
        return x
pd.options.display.max_rows = 40
#pd.options.display.float_format = '{:.2f}'.format

today = date.today()
today

datetime.date(2025, 1, 19)

In [3]:
# convert the timedelta object to a BusinessDay object
num_business_days = BDay(1)
yesterday = today - num_business_days
print(f'today: {today}')
print(f'yesterday: {yesterday}')

today: 2025-01-19
yesterday: 2025-01-17 00:00:00

In [4]:
# find the beginning of the week for the given yesterday
week_start = yesterday.to_period('W').start_time
week_end = yesterday.to_period('W').end_time
week_start = week_start.date()
week_end = week_end.date()
print(f'week start: {week_start}')
print(f'week end: {week_end}')

week start: 2025-01-13
week end: 2025-01-19

In [5]:
yesterday = yesterday.date()
week_start, yesterday

(datetime.date(2025, 1, 13), datetime.date(2025, 1, 17))

### Restart and Run All Cells

In [7]:
cols = 'quarter price target_price upside buy hold sell yield max_price min_price pe pbv dly_vol beta'.split()
colt = 'name price target_price upside buy hold sell market sector subsector dly_vol beta yield'.split()
colu = 'price target_price upside buy hold sell mrkt yield'.split()

format_dict = {
    'latest_amt_y':'{:,}','previous_amt_y':'{:,}','inc_amt_y':'{:,}',   
    'latest_amt_q':'{:,}','previous_amt_q':'{:,}','inc_amt_q':'{:,}',    
    'q_amt_c':'{:,}','y_amt': '{:,}','inc_amt_py':'{:,}', 
    'q_amt_p': '{:,}','inc_amt_pq':'{:,}', 
    'inc_pct_y': '{:.2f}%','inc_pct_q': '{:.2f}%',
    'inc_pct_py': '{:.2f}%','inc_pct_pq': '{:.2f}%',
    'mean_pct': '{:.2f}%','std_pct': '{:.2f}%','upside': '{:.2f}%', 
    
    'price':'{:.2f}','target_price':'{:.2f}','diff':'{:.2f}',
    'eps_a':'{:.2f}','eps_b':'{:.2f}',                
    'pe':'{:.2f}','pbv':'{:.2f}',
    'yield':'{:.2f}%',
    
    'price':'{:.2f}','max_price':'{:.2f}','min_price':'{:.2f}',   
    'target':'{:.2f}','max':'{:.2f}','min':'{:.2f}',
    'pe':'{:.2f}','pbv':'{:.2f}',
    'paid_up':'{:,.2f}','market_cap':'{:,.2f}',   
    'daily_volume':'{:,.2f}','beta':'{:,.2f}', 
    'dly_vol':'{:,.2f}',    
}

In [8]:
sql = '''
SELECT *
FROM profits
LIMIT 1'''
my_profit = pd.read_sql(sql, conmy)
my_profit.dtypes

id                  int64
name               object
year                int64
quarter             int64
kind                int64
latest_amt_y        int64
previous_amt_y      int64
inc_amt_y           int64
inc_pct_y         float64
latest_amt_q        int64
previous_amt_q      int64
inc_amt_q           int64
inc_pct_q         float64
q_amt_c             int64
y_amt               int64
inc_amt_py          int64
inc_pct_py        float64
q_amt_p             int64
inc_amt_pq          int64
inc_pct_pq        float64
ticker_id           int64
mean_pct          float64
std_pct           float64
dtype: object

In [9]:
sql = '''
SELECT *
FROM stocks
LIMIT 1'''
lite_stock = pd.read_sql(sql, conlite)
lite_stock.dtypes

id                 int64
name              object
max_price        float64
min_price        float64
status            object
buy_target       float64
sell_target      float64
volume           float64
beta             float64
cost             float64
qty                int64
buy_spread         int64
sell_spread        int64
available_qty      int64
bl               float64
sh               float64
reason            object
market            object
dtype: object

In [10]:
sql = '''
SELECT *
FROM tickers
LIMIT 1'''
pg_ticker = pd.read_sql(sql, conpg)
pg_ticker.dtypes

id                     int64
name                  object
full_name             object
sector                object
subsector             object
market                object
website               object
created_at    datetime64[ns]
updated_at    datetime64[ns]
dtype: object

In [11]:
sql = '''
SELECT P.name, market
FROM profits P
JOIN tickers T
ON P.ticker_id = T.id 
ORDER BY P.name'''
my_profits = pd.read_sql(sql, conmy)
my_profits

      name                             market
0   ADVANC            SET50 / SETHD / SETTHSI
1   ADVANC            SET50 / SETHD / SETTHSI
2   ADVANC            SET50 / SETHD / SETTHSI
3      BCH                     SET100 / SETWB
4     BDMS  SET50 / SETCLMV / SETTHSI / SETWB
5      BEM            SET50 / SETTHSI / SETWB
6       BH            SET50 / SETCLMV / SETWB
7      CBG            SET50 / SETCLMV / SETWB
8       CK         SET100 / SETCLMV / SETTHSI
9      CKP         SET100 / SETCLMV / SETTHSI
10     CRC  SET50 / SETCLMV / SETTHSI / SETWB
11    GULF          SET50 / SETCLMV / SETTHSI
12  INTUCH  SET50 / SETCLMV / SETHD / SETTHSI
13     MTC                    SET50 / SETTHSI
14   PLANB                   SET100 / SETTHSI
15     RCL                   SET100 / SETCLMV
16   ROJNA                               sSET
17   SYNEX                   SET100 / SETTHSI
18     TFG                                SET

### Create consensus from name-ttl and https://www.settrade.com/th/equities/quote/BCH/analyst-consensus

In [13]:
%pwd

'C:\\Users\\PC1\\OneDrive\\A5\\Weekly'

In [14]:
# Get the current working directory
current_dir = os.getcwd()
print(f"Current Directory: {current_dir}")

Current Directory: C:\Users\PC1\OneDrive\A5\Weekly

In [15]:
# Derive the base directory (to_dir) by removing the last folder ('Daily')
to_dir = os.path.dirname(current_dir)
print(f"Base Directory (to_dir): {to_dir}")

Base Directory (to_dir): C:\Users\PC1\OneDrive\A5

In [16]:
os.chdir(to_dir)
%pwd

'C:\\Users\\PC1\\OneDrive\\A5'

In [17]:
!ruby ruby\\crt-consensus-new.rb

Start at: Sunday, Jan 19 03:15 PM
Name,Target,Max,Min,Buy,Hold,Sell
ACE        1.50   1.50   1.50  0  0  0   1
ADVANC   301.74 330.00 283.42 10  5  0   2
AEONTS   147.35 160.00 130.00  8  2  0   3
AH        19.07  22.33  16.20  2  5  1   4
AIMIRT    13.63  13.80  13.45  2  0  0   5
AMATA     33.31  37.00  25.30 12  1  0   6
ANAN       0.76   0.82   0.70  1  0  0   7
AOT       67.62  73.00  50.00 11  2  1   8
AP        11.23  12.90   9.60 14  0  0   9
ASIAN     10.23  10.80   9.15  2  1  0  10
ASK       10.30  13.00   8.60  1  1  2  11
ASP        2.10   2.10   2.10  0  0  0  12
ASW       10.87  11.50  10.30  3  0  0  13
AWC        4.72   5.20   4.40  4  0  0  14
BA        27.36  30.00  20.40  5  1  0  15
BAM        7.79   9.30   6.70  1  5  0  16
BANPU      6.23   7.50   5.20  2  3  1  17
BAY       26.58  29.00  24.75  0  0  0  18
BBL      174.77 196.00 148.00  9  3  0  19
BCH       20.27  21.80  17.90 11  3  0  20
BCP       40.58  46.50  32.00 12  3  0  21
BCPG       7.98  10.00   6.00  6  1  1  22
BDMS      34.16  37.60  27.75 16  1  0  23
BE8       19.63  22.70  16.50  6  2  0  24
BEC        4.56   6.00   3.00  1  1  1  25
BEM       11.52  14.00  10.40 10  0  0  26
BGC        8.35   8.35   8.35  1  0  0  27
BGRIM     26.42  32.00  17.20  6  3  1  28
BH       253.42 285.00 223.04  7  7  0  29
BJC       28.96  32.00  24.00  7  5  0  30
BLA       24.50  27.00  22.00  1  1  0  31
BPP       11.83  12.50  10.80  1  0  0  32
BTS        5.61   6.49   4.67  1  5  0  33
BTSGIF     4.07   4.50   3.80  1  2  0  34
CBG       93.23 101.00  85.00 13  0  0  35
CENTEL    43.81  49.00  38.75  8  2  0  36
CHG        3.27   3.80   2.80  9  1  0  37
CK        26.18  28.00  23.00  7  0  0  38
CKP        4.36   5.20   3.10  8  2  1  39
COM7      29.26  32.00  25.10  6  3  0  40
CPALL     79.93  91.00  64.80 15  1  0  41
CPF       29.12  30.00  26.53 13  1  0  42
CPN       78.78  87.00  68.00  7  2  0  43
CPNREIT   12.54  14.50  11.10  3  2  0  44
CRC       40.01  44.50  35.00 17  0  0  45
DCC        1.89   1.93   1.80  0  0  0  46
DELTA    112.61 133.00  70.68  0  6  0  47
DIF       10.33  11.50   9.20  4  1  0  48
DOHOME    10.32  11.00   9.00  2  9  0  49
DRT        7.40   7.90   6.90  0  1  0  50
EA         3.80   3.80   3.80  0  1  0  51
EGATIF     5.95   5.95   5.95  0  0  0  52
EGCO     131.86 167.00 101.00  5  0  0  53
EPG        5.68   6.00   5.20  3  1  0  54
FPT       14.00  14.00  14.00  0  0  0  55
FTREIT    12.75  13.00  12.50  2  0  0  56
GFPT      13.20  17.00   9.90  9  4  1  57
GGC        5.05   5.20   4.90  0  1  0  58
GLOBAL    16.68  18.50  14.68  6  5  0  59
GPSC      50.75  60.00  42.00 12  1  1  60
GULF      64.75  75.00  58.00  5  4  0  61
GUNKUL     3.71   5.40   2.40  4  0  0  62
HANA      31.41  52.22  26.00  3  8  3  63
HMPRO     12.36  14.10   8.08 12  2  0  64
HTC       20.00  20.00  20.00  1  0  0  65
ICHI      19.93  23.00  15.00  3  3  0  66
III        7.70   9.10   6.30  2  2  0  67
ILM       22.56  26.73  20.00  3  0  0  68
IMPACT    14.10  14.10  14.10  1  0  0  69
INTUCH   107.69 123.00  86.00  2  4  0  70
IRPC       1.52   2.10   1.20  2  7  2  71
IVL       28.43  33.00  24.00  8  5  0  72
3BBIF      6.75   7.80   5.70  1  3  0  73
JMART     17.50  17.50  17.50  1  0  0  74
JMT       21.53  29.40  17.00  3  2  0  75
KBANK    170.69 193.00 150.00  8  4  0  76
KCE       30.19  35.50  24.00  9  5  1  77
KEX        2.97   4.80   1.70  0  1  0  78
KKP       54.95  65.00  47.00  3 10  0  79
KTB       24.25  26.90  23.00 11  1  0  80
KTC       48.00  55.00  39.00  3  6  2  81
LALIN      5.65   5.65   5.65  0  0  0  82
LH         6.29   7.90   5.20  3  7  0  83
LPN        2.48   3.30   1.80  0  1  0  84
M         30.89  34.00  29.57  1  3  0  85
MAJOR     18.02  20.50  14.00  6  1  0  86
MC        13.30  13.90  13.00  4  1  0  87
MEGA      45.54  57.00  37.00  5  2  0  88
MINT      38.61  45.00  33.50 13  0  0  89
MST       10.00  10.00  10.00  0  0  0  90
MTC       58.00  66.00  50.50 13  0  0  91
NER        6.27   8.00   5.00  7  1  0  92
ONEE       4.99   5.55   4.30  3  1  0  93
OR        16.88  22.00  12.60  6  4  2  94
ORI        4.63   5.65   4.00  2  4  1  95
OSP       25.40  30.00  21.00  8  7  0  96
PLANB      9.52  11.30   8.20  7  1  0  97
PRM       10.61  11.80  10.00  6  0  0  98
PSH        7.99  10.00   6.00  2  2  2  99
PSL        9.17   9.30   9.04  1  1  0 100
PTG       10.15  11.00   7.20  7  1  1 101
PTT       36.83  41.00  30.00  8  5  1 102
PTTEP    153.63 182.00 134.00 11  8  0 103
PTTGC     28.81  36.00  20.00  6  6  2 104
QH         2.03   2.14   1.82  2  4  1 105
RATCH     35.07  37.00  33.00  5  1  1 106
RBF        6.45   7.20   5.60  1  4  0 107
RCL       29.25  32.00  25.75  0  0  0 108
RJH       23.90  26.50  21.20  0  0  0 109
ROJNA      9.20   9.20   9.20  1  0  0 110
SAPPE     87.51 100.00  65.00 10  2  0 111
SAT       12.74  15.20  10.70  2  4  1 112
SAWAD     43.42  51.00  37.00  5  6  1 113
SC         3.27   3.46   3.00  7  0  0 114
SCB      118.62 130.00 109.00  3  9  0 115
SCC      184.64 230.00 150.00  2 10  2 116
SCCC     182.25 200.00 158.00  3  1  0 117
SCGP      21.06  29.00  14.00  4  9  3 118
SENA       2.00   2.00   2.00  0  0  0 119
SIRI       2.16   2.34   2.00 12  0  0 120
SJWD      16.69  20.20  14.00  7  0  0 121
SKR       13.00  13.00  13.00  1  0  0 122
SMPC      12.90  12.90  12.90  1  0  0 123
SPALI     21.73  24.00  18.00  9  4  0 124
SPRC       8.03  11.00   5.75  7  4  1 125
SSP        8.45   9.00   7.90  1  1  0 126
STA       24.36  33.70  20.12  7  0  0 127
STANLY   204.64 212.00 192.00  1  3  1 128
STGT      13.13  14.00  12.70  3  0  0 129
SUPEREIF   7.50   7.50   7.50  0  0  0 130
SVI        8.05   8.90   6.00  5  2  1 131
SYNEX     17.27  19.20  16.00  7  0  0 132
TASCO     20.84  22.40  19.50  6  1  0 133
TCAP      55.82  61.10  52.00  3  2  0 134
TFFIF      7.82   8.70   7.00  3  0  0 135
TFG        5.22   7.40   4.30  5  1  0 136
THANI      1.75   2.16   1.50  0  3  0 137
THG       13.70  15.20  12.20  0  0  0 138
TIDLOR    20.71  25.00  15.30 13  0  0 139
TISCO    100.50 112.00  92.00  3 12  1 140
TKN       11.40  13.60   7.00  2  0  0 141
TMT        4.04   4.04   4.04  0  0  0 142
TOA       21.73  23.20  20.00  2  1  0 143
TOP       30.63  42.00  21.00  5 11  4 144
TPIPL      1.44   1.44   1.44  0  0  0 145
TPIPP      3.10   3.20   3.00  1  0  0 146
TQM       33.67  38.00  28.00  2  1  0 147
TRUE      13.30  15.00   9.90  7  2  2 148
TTB        2.09   2.52   1.90  8  5  0 149
TTW       10.15  10.60   9.20  5  1  0 150
TU        15.65  19.30  12.90  9 11  0 151
TVO       26.10  29.00  22.10  3  2  0 152
UTP       10.00  10.00  10.00  0  0  0 153
VGI        2.12   2.16   2.08  0  1  0 154
VIBHA      2.74   2.74   2.74  1  0  0 155
WHA        6.37   6.90   5.30  8  3  0 156
WHAIR      8.13   8.60   7.40  4  0  0 157
WHART     11.41  12.50  11.00  3  1  0 158
WHAUP      5.74   6.10   5.30  2  1  0 159
WICE       6.60   7.40   5.80  1  1  1 160
WORK       7.45   7.45   7.45  0  0  0 161
End at: Sunday, Jan 19 03:22 PM

In [18]:
os.chdir(current_dir)
%pwd

'C:\\Users\\PC1\\OneDrive\\A5\\Weekly'

In [19]:
data_path = "../data/"
file_name   = 'consensus-new.csv'
input_file = data_path + file_name
consensus = pd.read_csv(input_file, sep=',', index_col=None)
consensus = consensus.rename(columns=str.lower)
consensus

       name  target     max     min  buy  hold  sell
0       ACE    1.50    1.50    1.50    0     0     0
1    ADVANC  301.74  330.00  283.42   10     5     0
2    AEONTS  147.35  160.00  130.00    8     2     0
3        AH   19.07   22.33   16.20    2     5     1
4    AIMIRT   13.63   13.80   13.45    2     0     0
..      ...     ...     ...     ...  ...   ...   ...
156   WHAIR    8.13    8.60    7.40    4     0     0
157   WHART   11.41   12.50   11.00    3     1     0
158   WHAUP    5.74    6.10    5.30    2     1     0
159    WICE    6.60    7.40    5.80    1     1     1
160    WORK    7.45    7.45    7.45    0     0     0

[161 rows x 7 columns]

In [20]:
consensus.query('buy + hold + sell == 0')

         name  target    max    min  buy  hold  sell
0         ACE    1.50   1.50   1.50    0     0     0
11        ASP    2.10   2.10   2.10    0     0     0
17        BAY   26.58  29.00  24.75    0     0     0
45        DCC    1.89   1.93   1.80    0     0     0
51     EGATIF    5.95   5.95   5.95    0     0     0
54        FPT   14.00  14.00  14.00    0     0     0
81      LALIN    5.65   5.65   5.65    0     0     0
89        MST   10.00  10.00  10.00    0     0     0
107       RCL   29.25  32.00  25.75    0     0     0
108       RJH   23.90  26.50  21.20    0     0     0
118      SENA    2.00   2.00   2.00    0     0     0
129  SUPEREIF    7.50   7.50   7.50    0     0     0
137       THG   13.70  15.20  12.20    0     0     0
141       TMT    4.04   4.04   4.04    0     0     0
144     TPIPL    1.44   1.44   1.44    0     0     0
152       UTP   10.00  10.00  10.00    0     0     0
160      WORK    7.45   7.45   7.45    0     0     0

In [21]:
prf_css = pd.merge(my_profits, consensus, on='name', how='inner')
prf_css.shape

(19, 8)

In [22]:
prf_css.buy.value_counts(normalize=True).to_frame().style.format('{:.2%}')

### Profits w/o consensus

In [24]:
df_merge = pd.merge(my_profits, consensus, on='name', how='outer',indicator=True)
prf_wo_css = df_merge['_merge'] == 'left_only'
df_merge[prf_wo_css]

Empty DataFrame
Columns: [name, market, target, max, min, buy, hold, sell, _merge]
Index: []

In [25]:
# First gets the filtered DataFrame of records that exist only in my_profits
prf_wo_css = df_merge['_merge'] == 'left_only'
filtered_df = df_merge[prf_wo_css]

# Then extracts just the 'name' column
names = filtered_df['name']

In [26]:
# Get the names as a list or tuple for SQL operations
names_list = names.tolist()

# Or if you want to see some statistics
print(f"Number of names found: {len(names)}")
print("\nFirst few names:")
print(names.head())

# If you need to check for any potential issues
print("\nAny null values:", names.isnull().any())
print("Unique names count:", names.nunique())

Number of names found: 0

First few names:
Series([], Name: name, dtype: object)

Any null values: False
Unique names count: 0

In [27]:
if names_list:
    placeholders = ','.join('?' * len(names_list))
    sqlDel = text(f"DELETE FROM profits WHERE name IN ({placeholders})")
    conmy.execute(sqlDel, names_list)

### Matching check with Buy table in MySql database to filter only records not yet in stocks

In [29]:
sql = """
SELECT name
FROM buy
WHERE active = 1"""
buy_df = pd.read_sql(sql, const)
buy_df.shape

(31, 1)

In [30]:
final_buy = pd.merge(my_profits, buy_df, on='name', how='outer', indicator=True)
final_buy

      name                   market      _merge
0    3BBIF                      NaN  right_only
1   ADVANC  SET50 / SETHD / SETTHSI   left_only
2   ADVANC  SET50 / SETHD / SETTHSI   left_only
3   ADVANC  SET50 / SETHD / SETTHSI   left_only
4       AH                      NaN  right_only
..     ...                      ...         ...
42     TMT                      NaN  right_only
43     TOA                      NaN  right_only
44     TVO                      NaN  right_only
45   WHAIR                      NaN  right_only
46   WHART                      NaN  right_only

[47 rows x 3 columns]

In [31]:
final_buy.rename(columns={'_merge':'merge_1'},inplace=True)
final_buy

      name                   market     merge_1
0    3BBIF                      NaN  right_only
1   ADVANC  SET50 / SETHD / SETTHSI   left_only
2   ADVANC  SET50 / SETHD / SETTHSI   left_only
3   ADVANC  SET50 / SETHD / SETTHSI   left_only
4       AH                      NaN  right_only
..     ...                      ...         ...
42     TMT                      NaN  right_only
43     TOA                      NaN  right_only
44     TVO                      NaN  right_only
45   WHAIR                      NaN  right_only
46   WHART                      NaN  right_only

[47 rows x 3 columns]

In [32]:
sql = """
SELECT name 
FROM stocks
ORDER BY name"""
lite_stocks = pd.read_sql(sql, conlite)
lite_stocks.shape

(31, 1)

In [33]:
df_merge = pd.merge(lite_stocks, final_buy, on='name', how='outer', indicator=True)
df_merge

      name                   market     merge_1      _merge
0    3BBIF                      NaN  right_only        both
1   ADVANC  SET50 / SETHD / SETTHSI   left_only  right_only
2   ADVANC  SET50 / SETHD / SETTHSI   left_only  right_only
3   ADVANC  SET50 / SETHD / SETTHSI   left_only  right_only
4       AH                      NaN  right_only        both
..     ...                      ...         ...         ...
42     TMT                      NaN  right_only        both
43     TOA                      NaN  right_only        both
44     TVO                      NaN  right_only        both
45   WHAIR                      NaN  right_only        both
46   WHART                      NaN  right_only        both

[47 rows x 4 columns]

In [34]:
not_in_final_buy = df_merge.loc[
    df_merge['_merge'] == 'left_only']
not_in_final_buy

Empty DataFrame
Columns: [name, market, merge_1, _merge]
Index: []

In [35]:
names = not_in_final_buy['name']
names

Series([], Name: name, dtype: object)

In [36]:
names = not_in_final_buy['name']
# Get the names as a list for SQL operations
names_list = names.tolist()

In [37]:
if names_list:
    placeholders = ','.join('?' * len(names_list))
    sqlDel = text(f"DELETE FROM stocks WHERE name IN ({placeholders})")
    conlite.execute(sqlDel, names_list)

In [38]:
not_in_port = final_buy.loc[
    final_buy['merge_1'] == 'left_only']
not_in_port

      name                             market    merge_1
1   ADVANC            SET50 / SETHD / SETTHSI  left_only
2   ADVANC            SET50 / SETHD / SETTHSI  left_only
3   ADVANC            SET50 / SETHD / SETTHSI  left_only
10    BDMS  SET50 / SETCLMV / SETTHSI / SETWB  left_only
11     BEM            SET50 / SETTHSI / SETWB  left_only
12      BH            SET50 / SETCLMV / SETWB  left_only
13     CBG            SET50 / SETCLMV / SETWB  left_only
14      CK         SET100 / SETCLMV / SETTHSI  left_only
15     CKP         SET100 / SETCLMV / SETTHSI  left_only
17     CRC  SET50 / SETCLMV / SETTHSI / SETWB  left_only
19    GULF          SET50 / SETCLMV / SETTHSI  left_only
21  INTUCH  SET50 / SETCLMV / SETHD / SETTHSI  left_only
27     MTC                    SET50 / SETTHSI  left_only
30   PLANB                   SET100 / SETTHSI  left_only
34   ROJNA                               sSET  left_only
41     TFG                                SET  left_only

In [39]:
file_name = 'consensus-ORD.csv'
data_file = data_path + file_name
output_file = csv_path + file_name
osd_file = osd_path + file_name
one_file = one_path + file_name

not_in_port.sort_values(['name'],ascending=[True]).to_csv(output_file, index=False)
not_in_port.sort_values(['name'],ascending=[True]).to_csv(data_file, index=False)
not_in_port.sort_values(['name'],ascending=[True]).to_csv(osd_file, index=False)
not_in_port.sort_values(['name'],ascending=[True]).to_csv(one_file, index=False)

### Process to combine profits and in-port records

In [41]:
sql = '''
SELECT P.name, 'O' AS sts
FROM profits P
ORDER BY P.name'''
df_prf = pd.read_sql(sql, conmy)
df_prf

      name sts
0   ADVANC   O
1   ADVANC   O
2   ADVANC   O
3      BCH   O
4     BDMS   O
5      BEM   O
6       BH   O
7      CBG   O
8       CK   O
9      CKP   O
10     CRC   O
11    GULF   O
12  INTUCH   O
13     MTC   O
14   PLANB   O
15     RCL   O
16   ROJNA   O
17   SYNEX   O
18     TFG   O

In [42]:
sql = '''
SELECT name, 'I' AS sts
FROM buy
ORDER BY name'''
df_buy= pd.read_sql(sql, const)
df_buy

       name sts
0     3BBIF   I
1        AH   I
2    AIMIRT   I
3       ASK   I
4       ASP   I
5       AWC   I
6       BCH   I
7   CPNREIT   I
8       DIF   I
9    GVREIT   I
10      IVL   I
11    JMART   I
12      JMT   I
13      KCE   I
14      MCS   I
15      NER   I
16      ORI   I
17      PTG   I
18    PTTGC   I
19      RCL   I
20      SCC   I
21     SENA   I
22   SINGER   I
23      STA   I
24    SYNEX   I
25    TFFIF   I
26      TMT   I
27      TOA   I
28      TVO   I
29    WHAIR   I
30    WHART   I

In [43]:
df_ttl = pd.concat([df_buy, df_prf], ignore_index=True)

In [44]:
duplicates_in_name = df_ttl[df_ttl['name'].duplicated(keep=False)]

duplicates_in_name

      name sts
6      BCH   I
19     RCL   I
24   SYNEX   I
31  ADVANC   O
32  ADVANC   O
33  ADVANC   O
34     BCH   O
46     RCL   O
48   SYNEX   O

In [45]:
df_unique = df_ttl.drop_duplicates(subset='name', keep='first')
df_unique

      name sts
0    3BBIF   I
1       AH   I
2   AIMIRT   I
3      ASK   I
4      ASP   I
..     ...  ..
43  INTUCH   O
44     MTC   O
45   PLANB   O
47   ROJNA   O
49     TFG   O

[45 rows x 2 columns]

In [46]:
names = df_unique['name'].values.tolist()
in_p = ", ".join(map(lambda name: "'%s'" % name, names))
in_p

"'3BBIF', 'AH', 'AIMIRT', 'ASK', 'ASP', 'AWC', 'BCH', 'CPNREIT', 'DIF', 'GVREIT', 'IVL', 'JMART', 'JMT', 'KCE', 'MCS', 'NER', 'ORI', 'PTG', 'PTTGC', 'RCL', 'SCC', 'SENA', 'SINGER', 'STA', 'SYNEX', 'TFFIF', 'TMT', 'TOA', 'TVO', 'WHAIR', 'WHART', 'ADVANC', 'BDMS', 'BEM', 'BH', 'CBG', 'CK', 'CKP', 'CRC', 'GULF', 'INTUCH', 'MTC', 'PLANB', 'ROJNA', 'TFG'"

In [47]:
sql = """
SELECT name 
FROM stocks
WHERE name NOT IN (%s)
"""
sql = sql % in_p
excess_stocks = pd.read_sql(sql, conlite)
excess_stocks

Empty DataFrame
Columns: [name]
Index: []

In [48]:
sql = """
SELECT name, status
FROM stocks
WHERE name  IN (%s)
ORDER BY name
"""
sql = sql % in_p
in_port_on_watch = pd.read_sql(sql, conlite)
in_port_on_watch

       name status
0     3BBIF      B
1        AH      X
2    AIMIRT      B
3       ASK      X
4       ASP      X
5       AWC      S
6       BCH      S
7   CPNREIT      B
8       DIF      B
9    GVREIT      B
10      IVL      X
11    JMART      B
12      JMT      S
13      KCE      B
14      MCS      B
15      NER      B
16      ORI      X
17      PTG      S
18    PTTGC      X
19      RCL      S
20      SCC      X
21     SENA      B
22   SINGER      X
23      STA      X
24    SYNEX      S
25    TFFIF      B
26      TMT      X
27      TOA      X
28      TVO      S
29    WHAIR      B
30    WHART      S

In [49]:
in_port_on_watch.query('status == "T"')

Empty DataFrame
Columns: [name, status]
Index: []

In [50]:
sql = """
SELECT name, status FROM stocks ORDER BY name"""
df_stocks = pd.read_sql(sql, conlite)
df_stocks

       name status
0     3BBIF      B
1        AH      X
2    AIMIRT      B
3       ASK      X
4       ASP      X
5       AWC      S
6       BCH      S
7   CPNREIT      B
8       DIF      B
9    GVREIT      B
10      IVL      X
11    JMART      B
12      JMT      S
13      KCE      B
14      MCS      B
15      NER      B
16      ORI      X
17      PTG      S
18    PTTGC      X
19      RCL      S
20      SCC      X
21     SENA      B
22   SINGER      X
23      STA      X
24    SYNEX      S
25    TFFIF      B
26      TMT      X
27      TOA      X
28      TVO      S
29    WHAIR      B
30    WHART      S

In [51]:
names_list = set(names)
names_in_df = set(df_stocks['name'])

missing_names = names_list - names_in_df
missing_names

{'ADVANC',
 'BDMS',
 'BEM',
 'BH',
 'CBG',
 'CK',
 'CKP',
 'CRC',
 'GULF',
 'INTUCH',
 'MTC',
 'PLANB',
 'ROJNA',
 'TFG'}

In [52]:
# Convert set to desired string format
formatted_str = ', '.join(f"'{item}'" for item in missing_names)
formatted_str

"'INTUCH', 'GULF', 'BH', 'CRC', 'TFG', 'CKP', 'MTC', 'CK', 'PLANB', 'ROJNA', 'CBG', 'BDMS', 'ADVANC', 'BEM'"

In [53]:
# Convert formatted string back to a list
names_list = [name.strip().strip("'") for name in formatted_str.split(",")]
names_list

['INTUCH',
 'GULF',
 'BH',
 'CRC',
 'TFG',
 'CKP',
 'MTC',
 'CK',
 'PLANB',
 'ROJNA',
 'CBG',
 'BDMS',
 'ADVANC',
 'BEM']

In [54]:
# Convert list to DataFrame
df = pd.DataFrame(names_list, columns=['name'])
df

      name
0   INTUCH
1     GULF
2       BH
3      CRC
4      TFG
5      CKP
6      MTC
7       CK
8    PLANB
9    ROJNA
10     CBG
11    BDMS
12  ADVANC
13     BEM

In [55]:
const.close()
conlite.close()
conpg.close()
conmy.close()